Merge pull request #5 from gszczutkowski/AOM-05
AOM-05 Update README.md and LICENSE
